/// -------------------------------------------------
/// access_if.h : 分布式对象接入公共头文件
/// -------------------------------------------------
/// Copyright (c) 2015, Wang Yujia <combo.xy@163.com>
/// All rights reserved.
/// -------------------------------------------------

#ifndef _ACCESS_IF_H_
#define _ACCESS_IF_H_

#include "Object_if.h"


/////////////////////////////////////////////////////
///            '分布式对象接口'说明
/// -------------------------------------------------
/// '分布式对象接口'(distributed object interface)是
/// 直接使用分布式方式访问对象的一个接口协议。
/// 1) 这里使用的iAccess对象是专门处理外部系统接入访
///    问DCOP系统的一个接入协议，除了提供通信接入方式，
///    还需要进行安全校验。
/// 2) 如果DCOP内部系统之间，可直接借助内部通信方式，
///    不需要进行安全方面的校验。
/// 3) 除了iAccess之外，还有其他的接入协议，比如iShell,
///    不同之出在于，除了安全方面的校验，还需要进行接
///    入协议的解析；而iAccess直接基于'分布式对象接口'
///    (distributed object interface)，是对象直接访问
///    对象的接口，因此不需要进行额外的解析工作。
/////////////////////////////////////////////////////


/// -------------------------------------------------
/// 定义IAccess版本号
/// -------------------------------------------------
INTF_VER(IAccess, 1, 0, 0);


/// -------------------------------------------------
/// 分布式对象接入接口定义
/// -------------------------------------------------
interface IAccess : public IObject
{
    /// 外部向内部输入消息
    virtual DWORD Input(
                        objMsg *pMsg, 
                        DWORD dwRemoteIP, 
                        WORD wRemotePort
                        ) = 0;

    /// 内部向外部输出消息
    virtual DWORD Output(
                        objMsg *pMsg, 
                        DWORD dwRemoteIP, 
                        WORD wRemotePort
                        ) = 0;
};


#endif // #ifndef _ACCESS_IF_H_

