/// -------------------------------------------------
/// avl.h : AVL树工具类公共头文件
/// -------------------------------------------------
/// Copyright (c) 2015, Wang Yujia <combo.xy@163.com>
/// All rights reserved.
/// -------------------------------------------------

#ifndef _TOOL_TREE_AVL_H_
#define _TOOL_TREE_AVL_H_


/////////////////////////////////////////////////////
///     AVL树:平衡二叉树
/// -------------------------------------------------
/// 平衡二叉树由于logN的时间效率，在排序和查找中有重
/// 要应用。
/// 形态匀称的二叉树称为平衡二叉树 (Balanced binary 
/// tree) ，其严格定义是：
/// 一棵空树是平衡二叉树；若 T 是一棵非空二叉树，其左
/// 右子树为 TL 和 TR ，令 hl 和 hr 分别为左、右子树
/// 的深度。当且仅当：
///   ①TL 、 TR 都是平衡二叉树； 
///   ② ｜ hl － hr ｜≤ 1；
/// 时，则 T 是平衡二叉树。
/////////////////////////////////////////////////////


/////////////////////////////////////////////////////
/// [移植说明] 来源于<http://www.oschina.net/code/explore/slony1-2.0.6/src/misc/>
/// [修改说明] 修改了原库的.h和.c的名称，并:
///     1. 调整了格式和增加了一些系统头文件的包含
/////////////////////////////////////////////////////


#ifdef __cplusplus
extern "C" {
#endif

#include "avl/avl_tree.h"

#ifdef __cplusplus
}
#endif


#endif // #ifndef _TOOL_TREE_AVL_H_

