/// -------------------------------------------------
/// prefix.h : Crit-bit Tree公共头文件
/// -------------------------------------------------
/// Copyright (c) 2015, Wang Yujia <combo.xy@163.com>
/// All rights reserved.
/// -------------------------------------------------

#ifndef _TOOL_TREE_PREFIX_H_
#define _TOOL_TREE_PREFIX_H_


/////////////////////////////////////////////////////
///     Crit-bit Tree概述
/// -------------------------------------------------
/// Crit-bit tree是一种特别的树结构，一般用于存放字符
/// 串。Critbit tree是一种BitWise tries，其树的深度为
/// O(longest-length)，有点像二叉树，不过对于字符串做
/// 分支检测的时候代价很小。
/// -------------------------------------------------
/// Crit-bit快速高效的支持下面的一些操作：
///  * 插入一个字符串
///  * 测试一个字符串是否在树里
///  * 删除一个字符串
///  * 查找出树中所有以某个字符串开始的所有字符串
/// -------------------------------------------------
/// 代码基于varnish, 并添加列出相同prefix字符串功能
/// -------------------------------------------------
/// http://blog.chinaunix.net/uid-26575352-id-3761437.html
/////////////////////////////////////////////////////


#ifdef __cplusplus
extern "C" {
#endif

#include "prefix/crit_bit_tree.h"

#ifdef __cplusplus
}
#endif


#endif // #ifndef _TOOL_TREE_PREFIX_H_

