/// -------------------------------------------------
/// monitor_if.h : 系统监控公共头文件
/// -------------------------------------------------
/// Copyright (c) 2015, Wang Yujia <combo.xy@163.com>
/// All rights reserved.
/// -------------------------------------------------

#ifndef _MONITOR_IF_H_
#define _MONITOR_IF_H_

#include "Object_if.h"


/// -------------------------------------------------
/// 定义IMonitor版本号
/// -------------------------------------------------
INTF_VER(IMonitor, 1, 0, 0);


/// -------------------------------------------------
/// 系统监控接口
/// -------------------------------------------------
interface IMonitor : public IObject
{
    
};


#endif // #ifndef _MONITOR_IF_H_

