/// -------------------------------------------------
/// luax_if.h : lua扩展公共头文件
/// -------------------------------------------------
/// Copyright (c) 2015, Wang Yujia <combo.xy@163.com>
/// All rights reserved.
/// -------------------------------------------------

#ifndef _LUAX_IF_H_
#define _LUAX_IF_H_


#include "Object_if.h"


/// -------------------------------------------------
/// 定义ILuaX版本号
/// -------------------------------------------------
INTF_VER(ILuaX, 1, 0, 0);


/// -------------------------------------------------
/// lua扩展接口(支持lua扩展功能)
/// -------------------------------------------------
interface ILuaX : public IObject
{
    
};


#endif // #ifndef _LUAX_IF_H_


