/// -------------------------------------------------
/// pythonx_if.h : python扩展公共头文件
/// -------------------------------------------------
/// Copyright (c) 2015, Wang Yujia <combo.xy@163.com>
/// All rights reserved.
/// -------------------------------------------------

#ifndef _PYTHONX_IF_H_
#define _PYTHONX_IF_H_


#include "Object_if.h"


/// -------------------------------------------------
/// 定义IPythonX版本号
/// -------------------------------------------------
INTF_VER(IPythonX, 1, 0, 0);


/// -------------------------------------------------
/// python扩展接口(支持python扩展功能)
/// -------------------------------------------------
interface IPythonX : public IObject
{
    
};


#endif // #ifndef _PYTHONX_IF_H_

