/// -------------------------------------------------
/// ObjConnect_if.h : 连接器对象公共头文件
/// -------------------------------------------------
/// Copyright (c) 2015, Wang Yujia <combo.xy@163.com>
/// All rights reserved.
/// -------------------------------------------------

#ifndef _OBJCONNECT_IF_H_
#define _OBJCONNECT_IF_H_

#include "Object_if.h"


/// -------------------------------------------------
/// 定义IConnect版本号
/// -------------------------------------------------
INTF_VER(IConnect, 1, 0, 0);


/// -------------------------------------------------
/// 连接器接口(连接系统之间的通信网关)
/// -------------------------------------------------
interface IConnect : public IObject
{
    
};


#endif // #ifndef _OBJCONNECT_IF_H_

