/// -------------------------------------------------
/// ObjControl_if.h : 控制器对象公共头文件
/// -------------------------------------------------
/// Copyright (c) 2015, Wang Yujia <combo.xy@163.com>
/// All rights reserved.
/// -------------------------------------------------

#ifndef _OBJCONTROL_IF_H_
#define _OBJCONTROL_IF_H_

#include "Object_if.h"


/// -------------------------------------------------
/// 定义IControl版本号
/// -------------------------------------------------
INTF_VER(IControl, 1, 0, 0);


/// -------------------------------------------------
/// 对象通知接口(生产者发布事件、消费者订阅事件)
/// -------------------------------------------------
interface IControl : public IObject
{
    
};


#endif // #ifndef _OBJCONTROL_IF_H_
