/// -------------------------------------------------
/// ObjProxy_if.h : 代理对象公共头文件
/// -------------------------------------------------
/// Copyright (c) 2015, Wang Yujia <combo.xy@163.com>
/// All rights reserved.
/// -------------------------------------------------

#ifndef _OBJPROXY_IF_H_
#define _OBJPROXY_IF_H_

#include "Object_if.h"


/// -------------------------------------------------
/// 定义IProxy版本号
/// -------------------------------------------------
INTF_VER(IProxy, 1, 0, 0);


/// -------------------------------------------------
/// 代理接口(分布式中跨系统代理对象)
/// -------------------------------------------------
interface IProxy : public IObject
{
    
};


#endif // #ifndef _OBJPROXY_IF_H_

